system reload dictionary dit."Системы";
system reload dictionary dit."Ответственность";

truncate table etl."Доступность";

insert into etl."Доступность" 
(hostid, "День", "Тригер", "ИД события", "Статус", "Время начала", "Время окончания", "Общее время", "Время недоступности", "Тяжесть", "Стоимость", "Цена недоступности")
select 
 hostid, "День", "Тригер", "ИД события", "Статус", "Время начала", "Время окончания", "Общее время", "Время недоступности", "Тяжесть", "Стоимость", "Цена недоступности"
from dwh_zabbix."Доступность";


alter table dit."Доступность" replace partition tuple() from etl."Доступность";